In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt

# Handling mussing data

In [3]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [10]:
print(string_data)
string_data[string_data.isnull()]

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

2    NaN
dtype: object

In [11]:
string_data[0]=None

In [12]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [13]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

# filtering data

In [14]:
from numpy import nan as NA

In [16]:
data = pd.Series([1, NA, 3.5, NA, 7])
data
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [20]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
....: [NA, NA, NA], [NA, 6.5, 3.]])

In [21]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
cleaned=data.dropna()

In [23]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [24]:
print(data)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [26]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [29]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [30]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [32]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0 -0.773290       NaN       NaN
1 -0.438574       NaN       NaN
2 -0.647219       NaN  0.501568
3 -1.346608       NaN -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

In [33]:
print(df)
df.dropna()

          0         1         2
0 -0.773290       NaN       NaN
1 -0.438574       NaN       NaN
2 -0.647219       NaN  0.501568
3 -1.346608       NaN -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

          0         1         2
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

In [35]:
print(df)
df.dropna(thresh=2)

          0         1         2
0 -0.773290       NaN       NaN
1 -0.438574       NaN       NaN
2 -0.647219       NaN  0.501568
3 -1.346608       NaN -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

          0         1         2
2 -0.647219       NaN  0.501568
3 -1.346608       NaN -0.279640
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

In [38]:
# if null in ssspecific col
df[(df[1].notnull())]

          0         1         2
4 -0.048465  0.361053  0.613887
5 -1.489086 -3.877057  1.116348
6 -1.421430 -0.669061 -0.153520

# Filling missing Data

In [ ]:
|